# coding: utf-8

"""
逆行列を使って連立方程式の解を求める
"""

import numpy as np
import matplotlib.pyplot as plt

# 単位行列
i_2 = np.identity(2)
i_3 = np.identity(3)

print(i_2)
print(i_3)

#==========
# 二元連立一次方程式
# x  + y  = 50
# 2x + 4y = 156
A1 = np.array([
	[1, 1],
	[2, 4]])
b1 = np.array([50, 156])

# A1の逆行列
A1_inv = np.linalg.inv(A1)
print(A1_inv)

# 単位行列になっているか確認
print(A1 @ A1_inv)

# 逆行列を使って二元連立一次方程式を解く
# A @ x = b
# x = A^-1 @ b
x1 = A1_inv @ b1
print(x1)

#==========
# 三元連立方程式
# 3x + 2y + 4z = 9
# 4x - 3y + 5z = 17
# x  - y  - 3z = -4
A2 = np.array([
	[3,  2,  4],
	[4, -3,  5],
	[1, -1, -3]])
b2 = np.array([9, 17, -4])

A2_inv = np.linalg.inv(A2) # 逆行列
x2 = A2_inv @ b2 # 計算
print(x2)

#==========
# 十元連立一次方程式
A3 = np.array([
	[1, 3, 7, 2, 1, 5, 3, 1, 8, 2],
	[4, 4,-1,-2, 1,-5, 4, 1, 3, 1],
	[5, 5,-1, 1, 2, 1, 5, 8, 3,-1],
	[3,-1, 2,-5, 3, 1, 6,-8, 1,-1],
	[2,-2,-5,-4,-5, 2, 6, 4,-3,-5],
	[6, 3, 3,-1, 1, 2,-6, 4, 1,-4],
	[7, 5,-2,-9,-5,-4, 9, 1,-2, 5],
	[3, 4, 3,-3, 9, 1, 2, 1, 3, 3],
	[2, 1, 5,-5,-8, 2, 1,-1, 3, 2],
	[1,-1, 4, 1, 7, 3, 9, 5, 8, 1]])
b3 = np.array([21,15,41,51,10,8,27,31,22,10])

A3_inv = np.linalg.inv(A3) # 逆行列
x3 = A3_inv @ b3 # 計算
print(x3)