# coding: utf-8

"""
Hello World
"""

#==========
# Main

# Set

member = {"DIO", "ヴァニラアイス", "ペットショップ"}
print(member)
# {'ペットショップ', 'ヴァニラアイス', 'DIO'}

print("ヴァニラアイス" in member)
# True

print("ヌケサク" in member)
# False

a = set("無駄無駄無駄無駄無駄無駄無駄ァ!!")
print(a)
# {'駄', '無', 'ァ', '!'}

b = set("ロードローラーだッ!!")
print(b)
# {'だ', 'ッ', 'ロ', 'ド', '!', 'ラ', 'ー'}

c = set("最高にハイってやつだッ!!")
print(c)
# {'イ', 'っ', 'に', '最', 'ハ', 'や', '高', 'つ', '!', 'だ', 'て', 'ッ'}

print(b - c)# bに存在してcに存在しない
# {'ラ', 'ロ', 'ド', 'ー'}

print(b | c)# bかcに存在する
# {'て', '最', 'ハ', 'っ', '高', 'に', 'イ', 'ー', 'だ', 'ロ', 'ド', '!', 'つ', 'ラ', 'ッ', 'や'}

print(b & c)# bとcに存在する
# {'ッ', 'だ', '!'}

print(b ^ c)# bまたはcにある共通しない文字
# {'イ', 'ロ', 'て', 'ー', 'っ', 'や', '高', 'つ', 'ラ', 'に', 'ド', 'ハ', '最'}
